Revit 2023 API
RebarHostData.GetFabricAreasInHost Method
 Returns all FabricArea elements hosted by the referenced element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2013
Syntax
C#
public IList<FabricArea> GetFabricAreasInHost()
Visual Basic
Public Function GetFabricAreasInHost As IList(Of FabricArea)
Visual C++
public:
IList<FabricArea^>^ GetFabricAreasInHost()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
See Also
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace